benchmark-REST.yml
config:
  target: 'https://g9fd0yor1e.execute-api.ap-southeast-1.amazonaws.com/kajkai'
  phases:
    - duration: 300
      arrivalCount: 150
  defaults:
    headers:
      Cookie: 'token=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJfaWQiOiIwMDE1OTkyZGZlOGExMjkyNjY1MWJmYzFjYWYiLCJpYXQiOjE1MDI3OTc4MDAsImV4cCI6MTUwMzAxMzgwMH0._5CFZX3bzoSkGmGixazTv7VbWZvuKx-YDrTfdoPHElk'
scenarios:
  - name: search and visit store
    flow:
    - get:
        url: '/search/category?id=-1&lat=21.0125993&lng=105.5255683&keyword=a'
    - get:
        url: '/store/rauga'
    - get:
        url: '/sellpost/store/0025992e022c57f2d2e781c34f6'